heatExchanger/all_auto/case_0_20/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet_fluid
    {
        type            patch;
        nFaces          35;
        startFace       26758;
    }
    outlet_fluid
    {
        type            patch;
        nFaces          26;
        startFace       26793;
    }
    walls_fluid
    {
        type            patch;
        nFaces          1366;
        startFace       26819;
    }
    walls_heater
    {
        type            patch;
        nFaces          204;
        startFace       28185;
    }
    base_fins
    {
        type            patch;
        nFaces          445;
        startFace       28389;
    }
)

// ************************************************************************* //
