heatExchanger/all_auto/case_0_20/constant/fluid/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    // Air

    specie
    {
        molWeight       28.9;
    }
    
    equationOfState
    {
        rho             1.196;
    }
    
    thermodynamics
    {
        Cp              1005;
        Hf              0;
    }
    
    transport
    {
        mu              1.8e-5;
        Pr              0.7;
    }
}

// ************************************************************************* //
